Autodesk.Revit.DB.MultiReferenceAnnotationOptions.ElementsMatchReferenceCategory(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Verifies that all of the elements match the reference category required
by the MultiReferenceAnnotationType.
elements:
The elements to test.
Returns:
True if all the elements match the reference category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.MultiReferenceAnnotationOptions.SetElementsToDimension(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the elements which the dimension will witness.
Remarks:
The dimension will automatically find geometric references in the elements.
elementsToDimension:
The elements which the dimension will witness.
Throws Autodesk.Revit.Exceptions.ArgumentException:
some elements do not match the reference category required by the MultiReferenceAnnotationType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The MultiReferenceAnnotationType assigned to the options can't create MultiReferenceAnnotations by element.
Since:
2014